testing-scripts/test_unencrypted-ngtcp2-throughput_via-B_delay-0ms_uncorrelated-loss-1_0_percent/output_log.txt
Running experiment: 1
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 47.59s, 0.02 req/s, 20.05MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 51371 sent, 821363 received
                     min         max         mean         sd        +/- sd
time for request:     47.58s      47.58s      47.58s         0us   100.00%
time for connect:     6.13ms      6.13ms      6.13ms         0us   100.00%
time to 1st byte:     7.16ms      7.16ms      7.16ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1626 times to write data ]
[ perf record: Captured and wrote 412.844 MB perf.data (59857 samples) ]
2. Generate FlameGraph
Running experiment: 2
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 45.47s, 0.02 req/s, 20.98MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50148 sent, 821364 received
                     min         max         mean         sd        +/- sd
time for request:     45.47s      45.47s      45.47s         0us   100.00%
time for connect:     4.85ms      4.85ms      4.85ms         0us   100.00%
time to 1st byte:     5.89ms      5.89ms      5.89ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1577 times to write data ]
[ perf record: Captured and wrote 400.558 MB perf.data (57927 samples) ]
2. Generate FlameGraph
Running experiment: 3
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 45.67s, 0.02 req/s, 20.89MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 51631 sent, 821367 received
                     min         max         mean         sd        +/- sd
time for request:     45.67s      45.67s      45.67s         0us   100.00%
time for connect:     4.95ms      4.95ms      4.95ms         0us   100.00%
time to 1st byte:     6.02ms      6.02ms      6.02ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1584 times to write data ]
[ perf record: Captured and wrote 402.370 MB perf.data (58320 samples) ]
2. Generate FlameGraph
Running experiment: 4
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 45.21s, 0.02 req/s, 21.10MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50794 sent, 821364 received
                     min         max         mean         sd        +/- sd
time for request:     45.21s      45.21s      45.21s         0us   100.00%
time for connect:     4.96ms      4.96ms      4.96ms         0us   100.00%
time to 1st byte:     6.12ms      6.12ms      6.12ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1580 times to write data ]
[ perf record: Captured and wrote 401.387 MB perf.data (57931 samples) ]
2. Generate FlameGraph
Running experiment: 5
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 45.23s, 0.02 req/s, 21.09MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50558 sent, 821362 received
                     min         max         mean         sd        +/- sd
time for request:     45.22s      45.22s      45.22s         0us   100.00%
time for connect:     5.06ms      5.06ms      5.06ms         0us   100.00%
time to 1st byte:     6.14ms      6.14ms      6.14ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1562 times to write data ]
[ perf record: Captured and wrote 396.888 MB perf.data (57368 samples) ]
2. Generate FlameGraph
Running experiment: 6
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 44.85s, 0.02 req/s, 21.27MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 51607 sent, 821368 received
                     min         max         mean         sd        +/- sd
time for request:     44.84s      44.84s      44.84s         0us   100.00%
time for connect:     4.91ms      4.91ms      4.91ms         0us   100.00%
time to 1st byte:     6.05ms      6.05ms      6.05ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1560 times to write data ]
[ perf record: Captured and wrote 396.340 MB perf.data (57435 samples) ]
2. Generate FlameGraph
Running experiment: 7
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 47.65s, 0.02 req/s, 20.02MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50696 sent, 821364 received
                     min         max         mean         sd        +/- sd
time for request:     47.65s      47.65s      47.65s         0us   100.00%
time for connect:     4.92ms      4.92ms      4.92ms         0us   100.00%
time to 1st byte:     5.98ms      5.98ms      5.98ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1589 times to write data ]
[ perf record: Captured and wrote 403.598 MB perf.data (58425 samples) ]
2. Generate FlameGraph
Running experiment: 8
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 45.29s, 0.02 req/s, 21.06MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50845 sent, 821365 received
                     min         max         mean         sd        +/- sd
time for request:     45.29s      45.29s      45.29s         0us   100.00%
time for connect:     5.04ms      5.04ms      5.04ms         0us   100.00%
time to 1st byte:     6.14ms      6.14ms      6.14ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1556 times to write data ]
Warning:
Processed 109678 events and lost 14 chunks!

Check IO/CPU overload!

[ perf record: Captured and wrote 395.305 MB perf.data (57252 samples) ]
2. Generate FlameGraph
Warning:
Processed 109678 events and lost 14 chunks!

Check IO/CPU overload!

Running experiment: 9
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 46.86s, 0.02 req/s, 20.36MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50390 sent, 821363 received
                     min         max         mean         sd        +/- sd
time for request:     46.85s      46.85s      46.85s         0us   100.00%
time for connect:     4.86ms      4.86ms      4.86ms         0us   100.00%
time to 1st byte:     5.89ms      5.89ms      5.89ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1592 times to write data ]
[ perf record: Captured and wrote 404.287 MB perf.data (58386 samples) ]
2. Generate FlameGraph
Running experiment: 10
1. Run throughput test
perf record -F 1997 --cpu=1 --call-graph dwarf taskset -c 1 ip netns exec mr_client  /root/evaluation/unencrypted_stack/nghttp2/src/h2load --npn-list h3 https://10.2.2.101:7777/1000000000
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 46.92s, 0.02 req/s, 20.33MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 50537 sent, 821364 received
                     min         max         mean         sd        +/- sd
time for request:     46.91s      46.91s      46.91s         0us   100.00%
time for connect:     5.03ms      5.03ms      5.03ms         0us   100.00%
time to 1st byte:     6.13ms      6.13ms      6.13ms         0us   100.00%
req/s           :       0.02        0.02        0.02        0.00   100.00%
[ perf record: Woken up 1606 times to write data ]
[ perf record: Captured and wrote 407.754 MB perf.data (58699 samples) ]
2. Generate FlameGraph